cmsis-svd/cmsis-svd/data/Renesas/R7FA2A1.svd
                <register>
                    <name>CLBSTR</name>
                    <description>Calibration Start Control Register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLBST</name>
                            <description>Calibration start control</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable writing</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start calibration</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLBSSR</name>
                    <description>Calibration Status Register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000.</description>
                            <lsb>1</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CLBSS</name>
                            <description>Calibration status</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Calibration is not running</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Calibration is running</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>TSN</name>
            <description>Temperature Sensor</description>
            <baseAddress>0x407EC000</baseAddress>
            <addressBlock>
                <offset>0x229</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x228</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TSCDRH</name>
                    <description>Temperature Sensor Calibration Data Register H</description>
                    <addressOffset>0x229</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>TSCDRH</name>
                            <description>The calibration data stores the higher 8 bits of the convertedvalue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSCDRL</name>
                    <description>Temperature Sensor Calibration Data Register L</description>
                    <addressOffset>0x228</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0x00</resetMask>
                    <fields>
                        <field>
                            <name>TSCDRL</name>
                            <description>The calibration data stores the lower 8 bits of the convertedvalue.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
