cmsis-svd/cmsis-svd/data/Renesas/R7FA2A1.svd
                <register derivedFrom="P100PFS">
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-7</dimIndex>
                    <name>P10%sPFS</name>
                    <description>P10%s Pin Function Control Register</description>
                    <addressOffset>0x044</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-7</dimIndex>
                    <name>P10%sPFS_HA</name>
                    <description>P10%s Pin Function Control Register</description>
                    <addressOffset>0x046</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <dim>7</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>1-7</dimIndex>
                    <name>P10%sPFS_BY</name>
                    <description>P10%s Pin Function Control Register</description>
                    <addressOffset>0x047</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register derivedFrom="P100PFS">
                    <name>P108PFS</name>
                    <description>P108 Pin Function Control Register</description>
                    <addressOffset>0x060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010010</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <name>P108PFS_HA</name>
                    <description>P108 Pin Function Control Register</description>
                    <addressOffset>0x062</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0010</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <name>P108PFS_BY</name>
                    <description>P108 Pin Function Control Register</description>
                    <addressOffset>0x063</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register derivedFrom="P100PFS">
                    <name>P109PFS</name>
                    <description>P109 Pin Function Control Register</description>
                    <addressOffset>0x064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <name>P109PFS_HA</name>
                    <description>P109 Pin Function Control Register</description>
                    <addressOffset>0x066</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <name>P109PFS_BY</name>
                    <description>P109 Pin Function Control Register</description>
                    <addressOffset>0x067</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register derivedFrom="P100PFS">
                    <dim>3</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-12</dimIndex>
                    <name>P1%sPFS</name>
                    <description>P1%s Pin Function Control Register</description>
                    <addressOffset>0x068</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_HA">
                    <dim>3</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-12</dimIndex>
                    <name>P1%sPFS_HA</name>
                    <description>P1%s Pin Function Control Register</description>
                    <addressOffset>0x06A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register derivedFrom="P100PFS_BY">
                    <dim>3</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <dimIndex>10-12</dimIndex>
                    <name>P1%sPFS_BY</name>
                    <description>P1%s Pin Function Control Register</description>
                    <addressOffset>0x06B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
